[
    {
        "timeline": "2024 Winter-Spring",
        "image": "/projects/images/red-trees-2.png",
        "gif": "/projects/gifs/RTRC-showcase.gif",
        "title": "RED TREES RAIL. CO.",
        "description": "VR Horror Train Simulator",
        "technology": "Unity",
        "published": "Steam",
        "playLink": "https://store.steampowered.com/app/2967460/RED_TREES_RAIL_CO/",
        "work": [
            "Real World Counterpart Research",
            "VR Interactions of Steam Locomotive",
            "Modeling of Objects and Environment",
            "All Animations",
            "Scripting of Events and Audio",
            "Notebook and Passenger Queue System"
        ],
        "more_info": [
            { "type": "div", "data": "<div class = 'steam-scale'> <iframe src='https://store.steampowered.com/widget/2967460/' frameborder='0' width='646' height='190'></iframe> </div>"},
            { "type": "video", "header": "Official Steam Store Trailer", "src": "https://www.youtube.com/embed/gmssdQquPD0", "title": "&quot;RED TREES RAIL. CO.&quot; Official Trailer"},
            { "type": "text", "header": "My Role", "data":"Proudly, I am the Team/Production Lead of Shayride Studios, the studio behind VR Horror RED TREES RAIL. CO.<br><br> I am also responsible for the programming, design, audio implementation, 3D modelling, and all other things &quot;Game Engine&quot;-related. <br><br> As the lead, I majorly contributed to producing documentation, presentations, and team planning to ensure a successful game production over our 6 month long Senior Capstone. <br><br>I undertook the overall process of publishing our game onto Steam. I created the store page: including the trailer, logos, screenshots, and writing."},
            { "type": "text", "header": "Senior Capstone Post-Mortem | 4 L's Retrospective", "data": "<b>What did you LOVE about working on this game?</b><br> I loved the research part of the trip. I loved having people try our game out and go through a lot of emotions. I loved working as a team and everyone contributing in their own ways. I loved going from paper design to virtual reality. I love the fact that we have a proper store page, making it so much easier to share and explain what we have been working on to everyone. I love our logo, game name, and studio name as there was a lot of care into creating them.<br><br><b>What did you wish you had, you LONGED for?</b><br> I wish I had more time. There were a lot of things we had to cut out. I wish that some features existed in Unity and OpenXR, there were a lot of limitations and workarounds to get the results I wanted. I wish I had a laptop, working entirely on a desktop at home was tricky. With all the time I spent on campus and commuting back home, a laptop would have saved a lot of time. Playtests could have gone smoother as well because things would have been tested earlier.<br><br><b>What did you LOATHE, you wish you didn't have?</b><br>I wish I didn’t get pneumonia during the later part of the quarter. It really delayed things and we lost a couple weeks. I also loathed how we had to crunch so much. I loathe how long the steam reviewing process is. The unknown and the possibility of delays is very stressful.<br><br><b>What did you LEARN from this?</b><br>I didn’t realize how much I would learn about the parts of a steam train and what they do. I see things much differently everytime I look at a steam train. I learned a lot about the process of publishing a game. I learned how valuable playtests are to confirm a design is working or if there is a problem. I also learned the value of trying our game on different hardware, as there were a surprising number of bugs and compatibility issues despite having the same Windows OS and headset. I didn’t realize how intensive game development is in general. Now I understand why things get delayed in the video game industry so much."},
            { "type": "image", "path": "/projects/images/pages/RTRC-close.png", "subtitle" : "Steam Train Close Up"},
            { "type": "image", "path": "/projects/images/pages/RTRC-glitch.png", "subtitle" : "Glitch Encounter"},
            { "type": "image", "path": "/projects/images/pages/RTRC-boss.png", "subtitle" : "Boss's Office"},
            
            { "type": "section", "title": "Inspired Through Limitations", "subtitle": "How did we get our artstyle?"},
            { "type": "text", "header": "Hand Drawn 2D Sprites", "data":"We wanted to be 100% original and not borrow from external sources. So we had to reflect on our team’s current abilities, and through clever decisions we created our cartoony, fun, detailed, yet simple artstyle.<br><br> In a VR game in a 3D world, I asked myself, how could we make characters with no 3D character design skills? <br><br>I learned about a technique called 2D Sprite 'Billboarding', which are 2D images that always face the player. I drew a few 2D characters and put them in a 3D environment to test how it would look in VR. I added a script that makes the 2D image always face the camera. Surprisingly, it came out great! <br><br>Utilizing the skills of my 2D artist, we were able to create trees, people, and other objects in the world. We wanted to create a unique hand-drawn visual experience."},
            { "type": "image", "path": "/projects/images/pages/RTRC-creep.png", "subtitle" : "My hand-drawn Creep at Industrial Station"},
            { "type": "image", "path": "/projects/images/RTRC-2D.png", "subtitle" : "Passengers and Trees"},
            { "type": "text", "header": "3D Models Made from 2 Shapes", "data":"Considering we also had no serious 3D modeling experience on our team, we had to come up with a solution. <br><br> I started off creating simple objects through the built-in Unity tools. Using only cubes and cylinders(rarely spheres), I constructed the entire game's 3D models. This includes the steam engine, the passenger car, the train station. <br><br>These 2 shapes were positioned, scaled, and rotated by hand."},
            { "type": "image", "path": "/projects/images/RTRC-preengine.png", "subtitle" : "First Steam Engine Model"},
            { "type": "image", "path": "/projects/images/RTRC-postengine.png", "subtitle" : "Final Steam Engine Model"},
            { "type": "image", "path": "/projects/images/pages/RTRC-model.png", "subtitle" : "Example of How I built these Models"},

            { "type": "section", "title": "A Product of Playtesting", "subtitle": ""},
            { "type": "text", "header": "Initial Playtests", "data":"User feedback and input played a huge role in ensuring our horror experience was effective. <br><br> During the first playtest for our jump scares, an accident occurred within our prototype. One of our playtesters accidentally threw the book down the aisle of the passenger car. The book had no gravity and kept floating down. As the player ran after the book, they triggered the jumpscare at the end, causing the player to scream in fear. Our JUMPSCARE had way MORE IMPACT than we imagined. <br><br> We unintentionally discovered a new design principles: BE INDIRECT. This principle encourages more clever interactions and catching the player off guard. <br><br>One example is a page that instructs the player to open the train window, which triggers a jumpscare."},
            { "type": "image", "path": "/projects/images/pages/RTRC-protoscare.gif", "subtitle" : "First Jumpscare Prototype in Passenger Car"},
            { "type": "text", "header": "To Drive A Train", "data":"We learned a lot in our initial gameplay prototype. A lot of players were successfully able to complete tutorial and operate the steam train with little to no external assistance. It was amazing to see, as we were worried people were going to stumble on the more “realistic” control approach. Thankfully, this design choice worked out. <br><br> We had two main features to ensure an effective tutorial: <br><br> - We created an interactive notebook for info and survival. This tutorial book was a hit, as players were able to refer to it when they got stuck during the actual game. <br><br>- We also created highlighted controls, signifying the next step in the tutorial. This was also a hit as most players were able to rely on it and learn by doing."},
            { "type": "text", "header": "My Interactive Notebook System", "data":"Because our game is in VR, I had to create diegetic controls and systems.<br><br>Our game has a fully functional notebook system that allows players to naturally open the front cover and flip through pages. <br><br>Any amount of pages can be seamlessly added at any time, from the editor or during gameplay. There is also a way to notify players of a certain page, with particles effects and an outline that will only be disabled when that page is properly viewed."},
            { "type": "image", "path": "/projects/images/pages/RTRC-book2pages.png", "subtitle" : "Player only interacts with 1 or 2 real pages even if 1000+ pages exist"},
            { "type": "image", "path": "/projects/images/pages/RTRC-booknotif.png", "subtitle" : "Sparkles appear when page added, outline gets removed on view"},
            { "type": "image", "path": "/projects/images/pages/RTRC-booknotif2.png", "subtitle" : "3rd page added but covered by another page"},
            { "type": "text", "header": "Notebook in Editor", "data":"Enabled pieces of the book such as the 'cover, pages, and writing' are determined by the current physical state in the game world. <br><br> For example, if the book is closed, then the physical page objects are disabled. If there is only one page, then only one physical page is enabled. <br><br> The book uses an array for pages, each assigned to 1 of 6 possible sprite locations. There is also an integer used to index which page should be outlined/provided notification to the player."},
            { "type": "image", "path": "/projects/images/pages/RTRC-book-module.png", "subtitle" : "Left: enabled book parts in game scene <br><br> Right: my script that controls book parts and 'pages' array"},
            { "type": "text", "header": "Steps to Start the Locomotive", "data":"I wanted the player to accurately follow the core steps of a real steam locomotive. Here are the realistic steps that the player is guided through during the tutorial:<br><br>1. Add oil to the firebox to fuel the fire.<br>2. Open cylinder cocks to allow condensed water to drain out.<br>3. Position the Johnson bar (reverser) forward for forward motion.<br>4. Release the brake to allow the wheels to turn freely.<br>5. Apply the throttle gradually to allow steam to flow into the cylinders.<br><br>Thankfully, each step/control is highlighted sequentially.<br><br>There is also a system in place if players mess up the previous steps down the line, ensuring they can continue correctly. For example, a player is at step 5 but there is no fuel left, then the oil can at step 1 will be re-highlighted."},
            { "type": "image", "path": "/projects/images/pages/RTRC-outline-control.png", "subtitle" : "Reverser Handle is highlighted, requiring attention"},
            { "type": "text", "header": "Initial Playtest Results", "data":"As a result of the initial playtests, we had a few fixes in mind to improve the user experience. <br><br>We wanted to fix the brake lever, since most players struggled with getting it to turn. We also wanted to fix some of the compatibility bugs we had with SteamVR and Oculus plugins, as that would disable the controllers for some reason. <br><br>We learned to provide some more clues or indicators. Most importantly, to add an indicator that the train is in a valid passenger pickup position, then stopping would trigger the passenger boarding procedure."},
            
            { "type": "text", "header": "Final Playtests", "data":"We learned how difficult and frustrating it can be to learn a new interface, especially if the player has zero steam locomotive knowledge.<br><br>We updated the tutorial, requiring the players to actually read the page before they can move on to the next step. We updated the information in the book, now the controls are referred to by their real name and their purpose is also given."},
            { "type": "image", "path": "/projects/images/pages/RTRC-pageimprove.png", "subtitle" : "Pages improved due to player feedback"},
            { "type": "text", "header": "Added Diegetic Chalk Notes", "data":"We noticed that players didn't know what did what or which was which, requiring me to guide them myself for them to progress through the prototype. <br><br>We added chalk notes to the interface to help provide context and foundation to the different locomotive controls. <br><br>This small addition allowed players to be independent in their playthroughs."},
            { "type": "image", "path": "/projects/images/pages/RTRC-diegetic-chalk.png", "subtitle" : "Diegetic Chalk Notes to guide players"},
            { "type": "text", "header": "Added Signal Blocks", "data":"Players also had trouble figuring out when and where to stop. <br><br>For example, players would stop too early and wouldn't trigger the passenger boarding sequence. Players sometimes passed the station completely. So we added signal blocks to each station and an extra page to the book for instruction. <br><br> Blinking means slow down. Solid Red signals the train is ready to station. Green is Go! <br><br>This solution effectively got players to board and drop off passengers successfully."},
            { "type": "image", "path": "/projects/images/pages/RTRC-signal-block.png", "subtitle" : "Added Signal Block to assist start/stop procedures"},
            { "type": "text", "header": "Other Final Improvements", "data":"We also updated the grabbing of the oilcan. Now it will auto-position the handle to the player’s hand, regardless of where they initially grabbed on the oilcan.<br><br> We also made the brake more powerful, so it actually acts like a brake(people were confused what it actually was doing). Before it was too weak and players were able to overpower it with the throttle. <br><br> We also added a ‘reverse’ function to the train, so now players can back up to the station correctly if they missed the station by accident. This also opens us up for more possibilities and other locomotive maneuvers."},
            
            { "type": "section", "title": "Our 3 Pivots", "subtitle": "Professors' Curveballs during Development"},
            { "type": "section", "title": "", "subtitle": "Pivot 1"},
            { "type": "text", "header": "Add horrific endings (you become the engine, you get tied to rails etc.)", "data":"We have a few horrific endings. In the MEGADEATH ending, you get tied to the tracks and get run over by the train itself. Also, a kid passenger can sneak onto the train and kill you from behind. A head can fly in from the window and kill you too."},
            { "type": "image", "path": "/projects/images/pages/RTRC-tracks.gif", "subtitle" : "MEGADEATH Ending"},
            { "type": "image", "path": "/projects/images/pages/RTRC-kid.gif", "subtitle" : "KID Ending"},
            { "type": "image", "path": "/projects/images/pages/RTRC-window.gif", "subtitle" : "WINDOW Ending"},

            { "type": "section", "title": "", "subtitle": "Pivot 2"},
            { "type": "text", "header": "Base it on the actual construction of a steam engine and a real route (Roaring Camp Railroads?) but keep the surrealist horror elements", "data":"During the development of our game, I conducted research trips with my team to examine and explore the local locomotives of Santa Cruz.<br><br> We took both the Santa Cruz Beach Train and the Henry Cowell Forest Train.<br><br>Our Steam Engine is based on Roaring Camp’s #1 Engine, 'The Dixiana'. I was able to get the engineers to take photos for us inside the cockpit. <br><br>The Passenger Car is based off the Santa Cruz Beach Train’s. I just shrunk it to fit the scale of the narrow-gauge tracks and the scale of the game."},
            { "type": "image", "path": "/projects/images/pages/RTRC-cockpit.JPEG", "subtitle" : "One of the Cockpit Photos of 'The Dixiana'"},
            { "type": "image", "path": "/projects/images/pages/RTRC-engine.png", "subtitle" : "My 3D Model vs. Roaring Camp's 'Dixiana'"},
            { "type": "text", "header": "Authentic Audio", "data":"Our audio is 100% original.<br><br>We have recorded the real Dixiana steam train during our research trips and I edited the audio to be game-ready(loopable, no talking over, etc.). <br><br>So players are not only interacting with a 1-1 scale of the real steam engine, but also listening to authentic audio of her.<br><br>We also did some foley work for other sound effects, like the death amulet cracking."},
            { "type": "image", "path": "/projects/images/pages/RTRC-car.png", "subtitle" : "My 3D Model vs. Santa Cruz Beach Train Passenger Car"},
            { "type": "text", "header": "The Train Route", "data":"What area perfectly fits within our horror forest, small town theme? Felton.<br><br>We hiked through Henry Cowell State Park along the train tracks to visit landmarks and to understand our environment better. <br><br>Our route is based on the “Big Trees and Pacific Railway”."},
            { "type": "image", "path": "/projects/images/pages/RTRC-gardenofeden.jpg", "subtitle" : "'Garden Of Eden' Photo from One of Our Research Trips"},
            { "type": "image", "path": "/projects/images/pages/RTRC-route-outline.png", "subtitle" : "Outline of the Route (Santa Cruz Beach Train Inspired)"},
            { "type": "text", "header": "Designing A Balance", "data":"Our parody is a gentle balance between realism and cartoony.<br><br>Working only with 2D sprites, cubes, cylinders, and a scaled down game world, we had to make critical choices in what to include and what details fit.<br><br>There are still horror elements integrated into the settings. We have given a creepy spin on the train route, with contextualizing lore:<br><br><i>&quot; Recent reports have noted creepy sightings and unusual events occurring on this new train route. Some have seen ghosts, distorted realities, and other abnormal sights.&quot;</i> "},
            
            { "type": "section", "title": "", "subtitle": "Pivot 3"},
            { "type": "text", "header": "Add a dynamic music system that works in the horror setting", "data":"We didn't have time to complete this pivot.<br><br>We had the concept of a radio that sits in the back of the cockpit or on the rear window. We wanted a creepy music soundscape that emphasizes the feeling of dread. We also experienced with different audio sound effects, like distortion and 'old radio' presets. <br><br> Our goal was to create a radio that plays normal music, but during the glitchy phases of the game, the audio would also become corrupted as well. Maybe create a ghost that speaks or creates noise through the radio speaker."},

            { "type": "section", "title": "Tech Requirements", "subtitle": ""},
            { "type": "text", "header": "What devices have you tested on? What devices should you test on still?", "data": "We have tested our build on 3 different Windows 11 x64 bit machines with Meta Quest 2’s:<br><br>Core i9, GTX 3090 Laptop<br>Core i5, GTX 1070 Ti Desktop<br>Ryzen 5,RTX 2060 SUPER Desktop<br><br>We have yet to test it on a lower-spec build. In many articles, the 1070 Ti is already considered the minimum for VR gaming. Because OpenXR only supports x64 bit processors and PCVR/Oculus Link is only supported on Windows OS, these are the only types of devices that we could test."},
            { "type": "image", "path": "/projects/images/pages/RTRC-3pcs.png", "subtitle" : "The 3 Devices We Tested On"},
            { "type": "text", "header": "What is your lowest framerate point? How does it compare on min spec to recommended spec?", "data":"Due to freezing bugs, we have reached a framerate of 0. We decided to test it on our weakest hardware(Core i5 and GTX 1070ti). In normal gameplay, we stick around 90FPS with 1-3FPS drops. In loading new scenes + physics calculations, we dropped to around 40FPS. Because of the VR refresh rate, the frame rate is capped to 90 FPS. I would assume with recommended hardware we wouldn’t notice any improvements besides less noticeable frame dips. <br><br><b>How long is your longest loading time? Where is it and what have you done to reduce it? Is it threaded or does it occur on limited render frames?</b><br> We have loads from Scene to Scene. The longest is from Main Menu to Tutorial, about 0.3 seconds.<br><br>We use Unity’s LoadScene() function. It is not threaded, it is blocking, thus it freezes the game until the next scene is fully loaded. We removed the Unity Hand Tracking Systems and Controls, which reduced the overall loading time of the XR rig. We could use LoadSceneAsync() if we wanted the scene to load in the background, but we have not tested its effects."},
            { "type": "image", "path": "/projects/images/pages/RTRC-fps-load.gif", "subtitle" : "FPS when going from Main Menu -> Tutorial"},
            { "type": "text", "header": "What is your final project deliverable size? Before and after unpacking?", "data":"Our Final Project’s size is pretty small. It is 66MB Zipped and 122MB Unzipped. Apparently it is even smaller on Steam."},
            { "type": "image", "path": "/projects/images/pages/RTRC-size.png", "subtitle" : "The Published Size of Our Game"},
            { "type": "text", "header": "Does your project contain any malicious code or injection opportunities?", "data":"Since our game is offline, contains no databases, and doesn’t have any input fields(All interactions are managed by Unity Input Manager), it is safe from network/SQL-style injection opportunities. However, there are still the possibilities of DLL injection, .NET decompilation, and Executable modification. <br><br><b>What bugs are still present in the game? What is their frequency and severity?</b><br> There is still a weird Freezing bug when a player bends down to pour oil, we are unsure how this occurs and we are unable to reproduce it. It happens very rarely but it is pretty problematic, requiring a restart. We are still trying to investigate it. Other than that, zero bugs/errors found through our extensive QA sessions testing every possible outcome/action."},
            
            { "type": "section", "title": "Accessibility Requirements", "subtitle": ""},
            { "type": "text", "header": "Does your project still include accessibility and language options?", "data":"Currently, our game build only supports English. We are trying to finalize our game’s design and art assets(pages, chalk, etc.) first. This process will prevent the need to constantly update and modify our Chinese and Japanese language packages with each new English iteration.<br><br>We however have started localization. Thankfully we have the assistance of people who live/lived in the soon-to-be supported countries."},
            { "type": "image", "path": "/projects/images/pages/RTRC-chalk.png", "subtitle" : "English Chalk Notes(Drawn By Garcia) in the Environment"},
            { "type": "image", "path": "/projects/images/pages/RTRC-jpn.jpg", "subtitle" : "My friend’s Japanese Translation is already outdated :("},
            { "type": "text", "header": "How did you ensure that your project’s user interface is navigable and usable for individuals with varying levels of ability?", "data":"Our entire game can be played with one hand and one button(the trigger). There is a book holder, so a player isn’t required to physically hold the book in one hand and flip pages with the other.<br><br><b>Was any playtesting done to ensure accessibility was working as intended (e.g. for color blind players).</b><br>We have not conducted accessibility playtests. <br><br><b>What have you done to ensure a positive ‘FTUE’(First Time User Experience)? </b><br>We have provided a tutorial to help onboard players into the game. We have also provided diegetic interfaces(“Put on hat to start game”, “Read information in the notebook”, chalk directions/hints)  to help provide context and immersion to the experience."},

            { "type": "section", "title": "My Slide Presentations", "subtitle": "Please click through to explore :)"},
            { "type": "slides", "header": "Pitch Deck Slides", "src": "https://docs.google.com/presentation/d/e/2PACX-1vTqWzH1FyNNzbXkVyFVFg_ASgjvENfkpEC4bPu1mDZUn7hgyj889z2yLAo7Gu8XNYnKsOR6eVwtP_2V"} ,
            { "type": "slides", "header": "Award(Design, Audio, Trailer, Tech.) Support Slides", "src": "https://docs.google.com/presentation/d/e/2PACX-1vTfVbO2YgHLnpvYpa02KnsZEJmp4gXm_yTN87EK3W3uZMkXl9Rb4SZmVIetApp4aeNEwU1pSKyRqzol"},
            { "type": "section", "title": "Vertical Slice", "subtitle": "Demo of All Concepts"},
            { "type": "image", "path": "/images/banner.png", "subtitle" : "<a href = 'https://riseagain1.github.io/Steam29/'>Vertical Slice Static Web Page</a>(banner shown)"},
            { "type": "projectbox",
                "header": "STEAM 29", 
                "src": "https://www.youtube.com/embed/yHLgqJzdlvY", 
                "title": "Steam 29 Virtual Reality - Vertical Slice Long Play",
                "description": "VR Vertical Slice",
                "work": [
                    "Integrating Past Prototype Knowledge",
                    "Environment Modeling and Design",
                    "Scripting and Implementation of Tutorial Scene"
                ]
            },
            { "type": "section", "title": "HiFi Prototyping Phase", "subtitle": "Implementing Design into Game Engine"},
            { "type": "section", "title": "", "subtitle": "Gameplay"},
            { "type": "projectbox",
                "header": "STEAM 29", 
                "src": "https://www.youtube.com/embed/ts-FFuCIr1U", 
                "title": "Steam 29 Virtual Reality - Control Demo",
                "description": "VR Steam Control Prototype",
                "work": [
                    "General Design, Research and Function",
                    "Modeling of Interfaces",
                    "Scripting/Programming of Interface and Movement"
                ]
            },
            { "type": "section", "title": "", "subtitle": "Splash Experience"},
            { "type": "projectbox",
                "header": "STEAM 29", 
                "src": "https://www.youtube.com/embed/oOmIeogY0AA", 
                "title": "Steam 29 Virtual Reality - Main Menu Demo",
                "description": "VR Main Menu Prototype",
                "work": [
                    "VR Interactions",
                    "Modeling",
                    "Animations"
                ]
            },
            { "type": "projectbox",
                "header": "STEAM 29", 
                "src": "https://www.youtube.com/embed/jIeJeq1NCnk", 
                "title": "Steam29 Tutorial Book Demo",
                "description": "VR Tutorial Prototype",
                "work": [
                    "Notebook functionality and Programming",
                    "General Design and Function",
                    "Modeling of Objects and Environment"
                ]
            },
            { "type": "section", "title": "", "subtitle": "Scene Flow"},
            { "type": "projectbox",
                "header": "STEAM 29", 
                "src": "https://www.youtube.com/embed/GFI7nct4ULY", 
                "title": "Steam 29 Virtual Reality - Scene Flow Demo",
                "description": "VR Scene Flow Prototype",
                "work": [
                    "2D Sprites (one can be seen in Shop)",
                    "General Design and Function",
                    "Modeling of Objects and Environment",
                    "Utilized Unity Programming Patterns for Scenes"
                ]
            },
            { "type": "projectbox",
                "header": "STEAM 29", 
                "src": "https://www.youtube.com/embed/aUB7ooOfdZQ", 
                "title": "Steam 29 Virtual Reality - Scare Demo",
                "description": "VR Scare Flow Prototype",
                "work": [
                    "Created Animations",
                    "Scripting of Events and Player Detection",
                    "Modeling of Objects and Environment",
                    "Flickering / Glitching of Train to represent Hallucinations"
                ]
            }
        ]
    },

    {
        "timeline": "2024 Spring",
        "image": "/projects/images/midterm.png",
        "gif": "/projects/gifs/office-showcase.gif",
        "title": "Office Clipboard Alpha",
        "description": "VR Draw-To-Life Experience",
        "technology": "Unity",
        "work": [
            "VR Interactable Clipboard and Pens",
            "Drawable Notebook Paper",
            "2D 'Drawn Ink' to 3D 'Doodle' System",
            "Art",
            "Environment"
        ],
        "more_info": [
            { "type": "video", "header": "Office Clipboard Alpha", "src": "https://www.youtube.com/embed/ZwLRHC5q3Uc", "title": "Office Clipboard Alpha Demo"},
            { "type": "text", "header": "Onboarding", "data": "Another day at the office, another paper to process. Is work truly endless?<br><br>Everyone seems tired and out of it. Everyone has lost their soul, literally…<br><br>Suddenly the souls of fellow co-workers start haunting the workplace! Out of fear of becoming like them, you reach deep into that inner-kid at heart.<br><br>With a pen in one hand and a clipboard in the other, put fun back into the workplace! It is your job to send these manifestations of negativity back home.<br><br><i>(undisclosed work responsibility of spreading positivity is unpaid)</i>"},
            { "type": "image", "path": "/projects/images/pages/office-alpha/ghost.png", "subtitle" : "Soul To Save"},
            { "type": "text", "header": "Tutorial Provided to Player", "data": "<b>TO PLAY, A PLAYER MUST:</b><br>- Grab the black pen<br><br><b>EITHER:</b><br>- Creatively draw anything to spawn a 1 health, slow, small 'Doodle'<br>- Precisely draw the Triangle or Square to spawn a stronger, faster 'Doodle'<br><br><b>ASSISTANCE:</b><br>- Use the pen to tap the neon buttons above the clipboard to cycle through holographic shape overlays.<br>- Shape overlays help assist players in how to draw the precision shapes.<br><br><br>- When the player is ready to spawn their 'Doodle', grab the bottom end of the page and throw it.<br>- Where the paper lands, the 2D drawn ink will become a 3D shape, thus a 'Doodle' has come to life.<br>- The 'Doodle' will attack the nearest 'Soul', and will lose one health point for each attack.<br>- Repeat until you can't handle the endless workplace environment<br><br><b>BONUS:</b> The green pen won't affect the shape recognition, allowing for doodling onto precision shapes. <br><br><i>New Gaming Interface may cause confusion</i>"},
            { "type": "text", "header": "Artist Statement", "data": "I wanted to deepen my VR skills by creating a unique and innovative experience.<br><br>As a game designer, I really want to specialize into the VR space. Looking back, this is the area of game development I share the most experience with.<br><br>With evolving tech and a growing industry, I aspire to create a big VR studio."},
            { "type": "text", "header": "Reflection of Fun", "data": "This course I learned the value of fun. Through exploration of unconventional tools and unknown worlds, that is where fun truly is in game design.<br><br>Playing another platformer isn't very exciting, but drawing in a 3D space and seeing your work come to life is something different. In such a sentence, we don't know what to imagine. What are we drawing? How do they come to life? What do they do once they share the same world as you? There are countless examples that we can tune our expectations to when we think of a platformer. How does this compare to Mario? Is this truly worth my time? Is this game better than the other platformers I could play right now?<br><br>We all played Minecraft. I remember having so much fun, but that flame dwindled once I explored all there was to see and things weren't new to me anymore. When learning to survive and craft became second nature, not a learning experience, is the point where I checked out for other experiences.<br><br>Break normal expectations, break conventional game design, provoke learning, embrace fun."},
            
            { "type": "slides", "header": "Early Ideation", "src": "https://docs.google.com/presentation/d/e/2PACX-1vSZN-ifmnriVTv9lqtNcfiVuyUL-jBRAIYEaRC-ABoxzjPbHdMznNIHJFBQHRa_2tWGp4L4eOcF0XXx"},
            { "type": "slides", "header": "Progress Check", "src": "https://docs.google.com/presentation/d/e/2PACX-1vTfesMQ3wWcqzRW150EUjOGwvJp5ZlBz17ME6-GV6LNSe-XVxU59FiTC98_YxwrQ2c2GoqNh4fqgolA"},
            { "type": "text", "header": "Progress Check Feedback", "data": "Below is feedback I collected from other classmates after sharing my work: <br><br><i>- can tear pages out to “submit button” it to spawn<br>- First person deploy forward<br>-    - Player is in spinning chair<br>- Keep janky 2D billboarding, don’t make it face player<br>-    - sharp turns make it disappear<br>- Doodlebob<br>- Add references in a book for player to use<br>-    - some hidden Easter eggs<br>- Can crumple paper to throw it further<br>- Maybe a table u can deploy them on, different height for different enemy type<br>- Sprites come to life, actually hopping around or spinning<br>-    - Make white pixels on texture transparent<br>- Keep shapes simple like those wizard spell casting games<br>- Make ink usage have an effect. <br>-    - More ink means heavy build(less speed, more damage) light build is speedy<br><br>- get a survey of people of what they would draw if they were to attack a dragon or something</i>"},
            
            { "type": "projectbox",
                "header": "Office Clipboard Alpha", 
                "src": "https://www.youtube.com/embed/RA55zuFaOi4", 
                "title": "Office Clipboard Alpha Proof Of Concept",
                "description": "VR Proof Of Concept",
                "work": [
                    "Ability to Draw On Paper",
                    "Shape Recognition",
                    "2D to 3D Doodle Spawning"
                ]
            },
            { "type": "text", "header": "Proof Of Concept Feedback", "data": "My Proof of Concept involved many core mechanics to be worked out before bringing my idea to life. My workflow involved linear algebra and documentation exploration.<br><br> I figured out how implementing a drawing system, allowing a pen collision to modify a 2D texture in real time. I created a system that can recognize shapes drawn onto the paper.<br><br> I also figured out how to convert the 2D drawn shapes into 3D entities/doodles. Multiple doodles can exist through my object pooling script. These doodles can also move around using a robust pathfinding script I wrote.<br><br> After presenting my working proof of concept, this is the feedback I received: <br><br><i>- Make drawing easier.<br>- Maybe add template on paper<br>- Connect the dots<br>- Make any drawing work with certain qualities<br>- Make clipboard better handled<br>- Make drawing more visible: thicker? 3D?<br>- Make narrative to make what is in scene make sense<br>- Tower defense? Turned based?<br>- Make clipboard snap to hand<br>- Spray paint utensil</i>"},
            { "type": "projectbox",
                "header": "Office Clipboard Alpha", 
                "src": "https://www.youtube.com/embed/D-6-iyzfbtc", 
                "title": "Office Clipboard Alpha - Midterm Build",
                "description": "VR Midterm Build",
                "work": [
                    "Green Pen Added for Fun Doodling",
                    "Better Pen Placements",
                    "Improved Clipboard Handling"
                ]
            },
            { "type": "text", "header": "Midterm to Final Notes - Workshop #3", "data": "After the midterm, many playtests were done and many new changes were made to my game. <br><br>The follow is a summary before the final build was showcased: <br><br><i><b>Feedback/Playtest notes:</b><br>- struggled holding things<br>- Broke game, requiring restart<br>- can't see doodles<br>- context non-existent, floating pages and random floor?<br>- struggled with drawing(considering multiple solutions rn)<br><br><b>Added:</b><br>- Can't lose clipboard or leave area<br>- improved pen and clipboard grab<br>- more context(office space, wa;ll decor', more detailed clipboard)<br>- Thicker/3D doodles<br>- Swivel Chair idea now added<br>- Particles for spawning<br><br><b>Questions:</b><br>- What enemy types? (Flying? Jumping?)<br>- What doodle types? (Doodle turret[can shoot lil projectiles] suggestions)<br><br><b>Goals:</b><br>- Revamp recognition system<br>- make drawing feel more natural(have played around with physical clipboard (: )<br>- tutorial<br>- add assistance/difficulty levels (traceable symbols / connect fixed dots)<br>- More polish and juice(audio, particles)<br>- More gameplay elements(HUD?[in enviro.: clock?], points, wave-based)<br><br>- add base always spawn (1 health)<br><br>- 5x5 grid, dot in them, <br><br><br>- letter recognition? fits with bueracracy<br>- paper itself is documents</i>"},
            { "type": "text", "header": "Development Approach for Shape Recognition", "data": "There will be a reference texture(T1) for each recognizable shape(triangle and square). The player's paper they draw onto is a dynamic texture(T2) that keeps changing when the pen object collides with it.<br><br> Using Linear Algebra, each collision changes the pixel color at the site of the collision. Each texture is a 2D array of (x,y) coordinates holding pixel data.<br><br>The following is an outline of a code that utilizes this data:<i><br><br>''Checker''<br><br>Have counter for hits<br>Have counter for misses<br><br><br>T2(drawn). loop thru black pixels(have a 2D array of drawn pixels made per instance)<br><br>If t2 pixel black and t2 pixel equal t1(reference) pixel:<br><br>T2 black is a hit<br><br>Else<br><br>T2 black is a miss<br><br></i> Determinations of shape patterns are made using a set hit/miss ratio."},
            
            { "type": "text", "header": "Design Notebook", "data": "I developed this project within the 10 week course, CMPM 180 under Professor Gorman.<br><br>The following images are digital scans of my physical design notebook. Each page details my process."},
            { "type": "image", "path": "/projects/images/pages/office-alpha/scans/1.jpg", "subtitle" : "Initial Outline of Creating Main Game Mechanic"},
            { "type": "image", "path": "/projects/images/pages/office-alpha/scans/2.jpg", "subtitle" : "Different Implementations for Shape Recognition"},
            { "type": "image", "path": "/projects/images/pages/office-alpha/scans/3.jpg", "subtitle" : "Collision Coord. to 2DTexture Coord. Conversion"},
            { "type": "image", "path": "/projects/images/pages/office-alpha/scans/4.jpg", "subtitle" : "Designing implementation of Doodle Spawn and Movement"},
            { "type": "image", "path": "/projects/images/pages/office-alpha/scans/5.jpg", "subtitle" : "How each Doodle selects enemy. Other design goals."},
            { "type": "image", "path": "/projects/images/pages/office-alpha/scans/6.jpg", "subtitle" : "Updating Clipboard Design and Outlining Doodle Spawning Mechanic"},
            { "type": "image", "path": "/projects/images/pages/office-alpha/scans/7.jpg", "subtitle" : "Post-Midterm Updates"},
            { "type": "image", "path": "/projects/images/pages/office-alpha/scans/note1.jpg", "subtitle" : "Post-Workshop #3 Updates"},
            { "type": "image", "path": "/projects/images/pages/office-alpha/scans/note2.jpg", "subtitle" : "Designing Holographic Shape Selector implementation"}
        ]
    },
    {
        "timeline": "2021 Summer",
        "image": "/projects/images/shadow-high.png",
        "gif": "/projects/gifs/shadow-showcase.gif",
        "title": "Shadow Cave",
        "description": "VR Prototype",
        "technology": "Unity",
        "work": [
            "Coded the Gesture Recognition for Hand Tracking",
            "3D Models for Cave and Scissors made in Blender",
            "Animation of Scissors",
            "Ideation/Design of Game and Puzzles",
            "Shadow Interactions System"
        ],
        "more_info": [
            { "type": "video", "header": "Shadow Cave VR Prototype", "src": "https://www.youtube.com/embed/uYddSZ4--6A", "title": "Shadow Cave VR Prototype"},
            { "type": "section", "title": "", "subtitle": "Journey within a 2D Shadow World using 3D Hand-Tracking Shadow Figures!"},
            { "type": "text", "header": "What part did you do?", "data": "I did everything besides foundational things (Unity game engine, Oculus Integration). I did the 3D models, ray tracing, lighting, and level design."},
            { "type": "image", "path": "/projects/images/pages/cave.png", "subtitle" : "Initial Concept Design"},
            { "type": "text", "header": "What skills does it demonstrate?", "data": "Concept Design, Level Design, System Design, Programming. <br><br>I took inspiration from Greek philosopher Plato and his metaphorical story of a cave. I used that to develop a prototype for a game that utilizes hand tracking to create shadow puppets interacting with the shadow world in the cave. <br><br>I created a gesture recognition system in code and utilized a ray tracing system to simulate interaction between shadows. I learned Blender to 3D model the shadow puppets (e.g., a pair of scissors). I also had to determine the types of actions the user could perform (e.g., cut string, create a shield)."},
            { "type": "image", "path": "/projects/images/pages/cave-gesture-diagram.png", "subtitle" : "Shadow Hand-Tracking Concept"},
            { "type": "image", "path": "/projects/images/pages/cave-level-design.png", "subtitle" : "Potential Level Design"},
            { "type": "image", "path": "/projects/images/pages/cave-level.png", "subtitle" : "Prototype Level with Obstacles"},
            { "type": "text", "header": "What would you do differently if you started this over?", "data": "I had less than 2 weeks to work on it, including learning tools like Blender and Unity. I would definitely add more polish, build a more complete game, and include a title screen, more gameplay, and an ending. I definitely wanted to finish this and publish it on the Oculus Store."},
            { "type": "image", "path": "/projects/images/pages/cave-raycast-concept.png", "subtitle" : "Ideation of Raycast Implementation"},
            { "type": "image", "path": "/projects/images/pages/cave-raycast-motion.gif", "subtitle" : "Raycast and Environment Visualization"},
            { "type": "text", "header": "What other work does this make you want to do?", "data": "It inspired me to explore the world of VR development. I believe this niche format of games is a fantastic space for creativity and innovation. I would love to work in the VR game industry."},
            { "type": "text", "header": "Other thoughts about this piece:", "data": "I always enjoy looking back and thinking about how cool my concept was. It actually worked! With a sense of accomplishment and a new foundation in game development, this project was the start of my journey."},
            { "type": "text", "header": "Final Reflection and Notes for Future Me", "data": "As a computer engineering major who has only completed freshman year, I was very nervous about taking my first upper-division course, which was also outside of my curriculum and skill set. I was unsure how I would stack up against other students who had taken game design courses, but I decided to challenge myself. I remember when we shared our ideas with the class, I felt that my goals were too ambitious. Surprisingly, I was able to turn my idea into a working prototype.<br><br>I feel like this course can be great for anyone willing to learn and put in the effort. This is a true reflection of what a college education should look like, and I do not regret it at all. We trained on how to think like a college student with concepts, industry discussions, and applications of our skills to future technology. It is not a repetitive course where you memorize problems or read a textbook; instead, it is an impactful and extensive learning experience.<br><br>I am very thankful for this opportunity. If there is one thing to remember, 'if you set your mind to big ideas, you can achieve them.' In terms of motivation, 'remember the purpose of college and how it improves you as a person, student, and creator.'"}
        ]
    },

    {
        "timeline": "2023 Fall",
        "image": "/projects/images/gameboy_break.png",
        "gif": "/projects/gifs/break-fp.gif",
        "title": "Retro-Active",
        "description": "A ''Game within the game'' Platformer",
        "technology": "Unity",
        "published": "Itch.io",
        "playLink": "https://ichigo33.itch.io/retro-active",
        "work": [
            "Team Leader and Recruited Members",
            "Game Idea and Design",
            "Cartridge Animations",
            "Programmed \"Retro Games\" Mechanic",
            "This Game Trailer!"
        ],
        "more_info": [
            { "type": "video", "header": "Retro-Active Game Trailer", "src": "https://www.youtube.com/embed/YhgDfn1uXgI", "title": "Retro-Active Game Trailer"},
            { "type": "text", "header": "My Role", "data":"Proudly, I was the Team Lead of xX Dark Sk8rs Xx, the team behind 'Retro-Active'. I recruited members based on their abilities and assigned them their proper roles. <br><br> In a team of five, we produced and publicly released a video game that allows for 2D retro games to interact with a 3D environment. <br><br>I overseered the overall design of the project and provided the team with solutions when needed. I implemented the main game mechanics using C# and Unity API features. I also did the cartridge animations. <br><br> I was also entirely responsible for the game trailer. I designed, recorded, edited, and uploaded it."},
            { "type": "text", "header": "Personal Reflection", "data": "Looking back at Retro-Active, I am very proud of each of our team members and what we were able to achieve. We have followed and fulfilled our concept nicely. It’s fun and creative. I feel it is the best completed game I have worked on so far, and it definitely has the best group work contribution too. Compared to other classes, it seems that only one person would construct the game, but all 5 of us had an active role in its creation. I would love to show off this game more.<br><br>Also thank you all for trusting the game concept, I hope it was as satisfying to see it come to life to you as it was for me."},
            { "type": "text", "header": "Development Process", "data":"Instead of explaining it, I want to show the raw 'behind the scenes' of our development process. <br><br> What follows are some snippets of my contributions:"},
            { "type": "image", "path": "/projects/images/pages/retro-active/initial-pitch.png", "subtitle" : "My Initial Idea Pitch"},
            { "type": "image", "path": "/projects/images/pages/retro-active/pitch-resource.png", "subtitle" : "Example of Supporting with Game Engine Resources"},
            { "type": "image", "path": "/projects/images/pages/retro-active/idea-to-implementation.png", "subtitle" : "Guiding Team From Concept to Implementation"},
            { "type": "image", "path": "/projects/images/pages/retro-active/2d-brainstorm.png", "subtitle" : "Brainstorming 2D Game + 3D Effect"},
            { "type": "image", "path": "/projects/images/pages/retro-active/gameplay-fork.png", "subtitle" : "Deciding the Flow of Gameplay"},
            { "type": "image", "path": "/projects/images/pages/retro-active/2d-3d-presence.png", "subtitle" : "Design Choice of 2D Cartridges in 3D Space"},
            { "type": "section", "title": "", "subtitle": "My 'Game within the Game' Mechanic"},
            { "type": "projectbox",
            "header": "Retro-Active", 
            "src": "https://www.youtube.com/embed/kAfBP2pE8_c", 
            "title": "Retro-Active | Wang Liao FPS and 2D Controllers",
            "description": "Initial Prototype",
            "work": [
                "NOT MY VIDEO",
                "Wang Liao's FPS and 2D Controllers"
            ]
            },
            { "type": "text", "header": "Bringing the Idea to Life", "data":"The previous video demonstrates my teammate's work, creating the First-Person 3D Controller and the 2D 'bridge builder' mini-game. <br><br> I took it on myself to merge both his 3D FPS Controller and his 2D Game Controller, as seen in the following video below. <br><br> I merged the code and created a FSM(Full State Machine) to dictate what 2D cartridge is loaded and if the retro handheld is on, which in turn determines whether the user controls the 3D player or the 2D player. <br><br> I allowed the 2D Game instance to load into the current 3D scene, so both worlds can run simultaneously. <br><br> I also updated the 2D game to have a end condition, which stops the 2D game once a certain amount of planks is caught by the 2D player. As a result of this end condition, a bridge is constructed in the 3D world. <br><br> Thus, I have finally proved my game idea to be a working concept."},
            { "type": "projectbox",
            "header": "Retro-Active", 
            "src": "https://www.youtube.com/embed/EvHy3i7TcPU", 
            "title": "Retro-Active | Phil Merged Wang's Work",
            "description": "Proof of Concept",
            "work": [
                "I merged Wang's Scripts and Scenes into One",
                "Proving the 'Game within the game' Concept"
            ]
            },
            { "type": "text", "header": "Making The Second Retro Game Cartridge", "data":"I also implemented the second game cartridge, a remix of the famous 'Break Out' game. We decided to reset the 2D game every time the player loses(ball goes past the paddle). <br><br> I had a bit of trouble with the overall physics of the game. The bricks were a little wonky at first, but that issue was quickly resolved. <br><br>A much bigger problem was the ball physics. There was weird friction on the ball, so any bounce off of walls or bricks was glitchy. As a workaround, I added a 'bounceMultiplier' in the ball's bounce script, so it doesn't slow down nor speed up during a bounce."},
            { "type": "section", "title": "", "subtitle": "My Animations"},
            { "type": "projectbox",
            "header": "Retro-Active", 
            "src": "https://www.youtube.com/embed/ffnBTYJGUE0", 
            "title": "Retro-Active | Phil's Cartridge Animation Progress",
            "description": "Cartridge Animation Progress",
            "work": [
                "Testing My Cartridge Animations",
                "Created a FSM Script to Coordinate Everything"
            ]
            },
            { "type": "image", "path": "/projects/images/pages/retro-active/animation-feedback.png", "subtitle" : "Group Feedback of My Final Animations :)"},
            { "type": "text", "header": "Cartridge Animations", "data":"I wanted a bit more juice in the presentation of the 2D Game Cartridges, as they were the main focus and theme of the game. This video is an early proof-of-concept of the animations I wanted for the handheld. <br><br> Before, the cartridge was static within the handheld. After my contribution, cartridges now float and are inserted/ejected from the handheld. I also wanted the cartridges to spin in the air, awaiting for the player to grab it.<br><br> Below are gifs from the final product, showing my animation work and my 2D->3D mechanic in action."},
            { "type": "section", "title": "", "subtitle": ""},
            { "type": "image", "path": "/projects/images/pages/retro-active/grab-fp.gif", "subtitle" : "Grabbing a Cartridge (First Person)"},
            { "type": "image", "path": "/projects/images/pages/retro-active/grab-tp.gif", "subtitle" : "Grabbing a Cartridge (Third Person)"},
            { "type": "image", "path": "/projects/images/pages/retro-active/build-fp.gif", "subtitle" : "Building a Bridge (First Person)"},
            { "type": "image", "path": "/projects/images/pages/retro-active/build-tp.gif", "subtitle" : "Building a Bridge (Third Person)"},
            { "type": "image", "path": "/projects/images/pages/retro-active/break-fp.gif", "subtitle" : "Breaking Rocks (First Person)"},
            { "type": "image", "path": "/projects/images/pages/retro-active/break-tp.gif", "subtitle" : "Breaking Rocks (Third Person)"},
            { "type": "text", "header": "Coordinating the Animations", "data":"Creating the animations was one thing, controlling them through code was another. <br><br> I had to ensure that the correct animations played when cartridges were switched out or picked up. <br><br> For example, switching from 'Bridge Builder II' to 'Breakout' required the coordination from a state machine. This ensured 'Bridge Builder II' was ejected first, then 'Breakout' was inserted after. <br><br> The state machine not only triggers the correct animations, but the timing of them. In the previous example, 'Breakout' must wait until the handheld is clear, thus preventing the collision of the cartridges. "},
            { "type": "section", "title": "", "subtitle": "Award"},
            { "type": "image", "path": "/projects/images/pages/retro-active/award.png", "subtitle" : "Our Team Wins in Technology"},
            { "type": "text", "header": "Being Best in Tech", "data":"At the start, we were given the theme 'Game within the game'. <br><br> Thanks to my game concept and my command of the implemention, I lead my team to win the Class's Tech Award. <br><br> I still remember the gasps and excitement from people seeing the 2D Gameboy display booting up for the first time. A simple yet powerful moment, showing an entire 2D game running within the existing 3D game. <br><br> In a class of 120+ students, our team of 5 was voted the best in technology. I am very proud of them."},
            { "type": "image", "path": "/projects/images/pages/retro-active/gb-6.png", "subtitle" : "A Product Of Teamwork"}
        ]
    },

    {
        "timeline": "2023 Fall",
        "image": "/projects/images/fright_close.png",
        "gif": "/projects/gifs/fright-showcase.gif",
        "title": "The Fun Frightful Walking Simulator",
        "description": "Experience",
        "technology": "Unity",
        "work": [
            "Upgraded my First Person Movement and Camera controller",
            "Scripting of Events and Player Detection",
            "General Design and Layout",
            "User Interface and Main Menu",
            "Flashlight Model, Light Cookie, and Script"
        ]
    },

    {
        "timeline": "2023 Fall",
        "image": "/projects/images/stadium-90.png",
        "gif": "/projects/gifs/stadium-showcase.gif",
        "title": "Stadium Ghouls",
        "description": "Horror Game",
        "technology": "Unity",
        "work": [
            "Constructed First Person Movement and Camera",
            "AI configuration for Ghouls",
            "General Design and Layout of Baseball Stadium",
            "User Interface and Main Menu",
            "Flashlight Model and Script"
        ]
    },

    {
        "timeline": "2024 Winter",
        "image": "/projects/images/OAOA-2.png",
        "gif": "/projects/gifs/OAOA-showcase.gif",
        "title": "One Algo Over All",
        "description": "Dual Narrative",
        "technology": "Unity",
        "published": "Github Pages",
        "playLink": "https://meyerphil.github.io/HUMN45-FinalProject/",
        "work": [
            "Team Lead and Designer",
            "2D Player Controller",
            "Splitscreen Config and UI",
            "Tasks List and Wallet",
            "Dystopian Coded Bias Algorithm"
        ]
    },
    {
        "timeline": "2023 Fall",
        "image": "/projects/images/dodger.png",
        "gif": "/projects/gifs/dodger-play.gif",
        "title": "Block Dodger",
        "description": "One-Button Survival",
        "technology": "CrispGameLib",
        "published": "Github Pages",
        "playLink": "https://meyerphil.github.io/block-dodger/index.html?mygame",
        "work": [
            "Game Design / Ideation",
            "2D Player Controller and Collision",
            "Simple Sprite Art",
            "Scaling, Moving and Falling Blocks"
        ]
    },

    {
        "timeline": "2022 Spring",
        "image": "/projects/images/doodle4-crop.png",
        "gif": "/projects/gifs/forest-draw.gif",
        "title": "Doodlebob",
        "description": "Collaborative Drawing App",
        "technology": "HTML/P5.JS",
        "published": "Heroku",
        "playLink": "https://doodlebob-art101.herokuapp.com/",
        "work": [
            "Multiple Clients can draw on Server Canvas",
            "User List with User Colors and Name Input",
            "Drawing Prompt Generator",
            "Server-Side Pixel Data Processing",
            "Private and Unique Client Connections"
        ],
        "more_info": [
            
            { "type": "text", "header": "What part did you do?", "data": "I did most of the underlying code for the drawing feature. I added some extra features too on the drawing page."},
            { "type": "text", "header": "What skills does it demonstrate?", "data": " Technical programming. I could work off the foundation that my groupmate made, learn his code, and expand upon it. I was able to utilize a server to optimize saving the canvas instance and sharing its changes to users. I also added a prompt generator, user colors, and the ability to set your name."},
            { "type": "image", "path": "/projects/images/pages/doodlebob-playground.png", "subtitle" : "Playground created by multiple people"},
            { "type": "text", "header": "What would you do differently if you started this over?", "data": " I would have started on it early with my group. I think that the art and overall presentation could have been more polished. The title page is much cleaner compared to the actual drawing page I designed."},
            { "type": "text", "header": "What other work does this make you want to do?", "data": " I would like to explore the limitations and wild things I could create in browsers. Maybe a game that requires multiple browsers to be opened across devices?"},
            { "type": "text", "header": "Other thoughts about this piece:", "data": "I love how it came out. The concept was really fun. It was funny seeing 100 students in the class collectively join and try to draw a cat or a beach together. It was wacky and wild."}
        
        ]
    },

    {
        "timeline": "2022 Spring",
        "image": "/projects/images/idego.png",
        "gif": "/projects/gifs/idego-showcase.gif",
        "title": "Id & Ego",
        "description": "Hack-n-Slash Platformer",
        "technology": "Construct3",
        "published": "Github Pages",
        "playLink": "https://meyerphil.github.io/Id-Igo/",
        "work": [
            "Player Movement/Shooting Mechanics",
            "Dodging Ability",
            "Boss AI"
        ],
        "more_info": [
            { "type": "text", "header": "What part did you do?", "data": "I did the movement mechanics and the enemy boss code."},
            { "type": "text", "header": "What skills does it demonstrate?", "data": "Technical programming, design. Learning how to create states for boss attacks and designing each phases' attacks. Also learning how to create a dodge mechanic, then implementing it correctly so it feels nice."},
            { "type": "text", "header": "What would you do differently if you started this over?", "data": "I would try to fix the melee weapon’s usefulness. It seems to actually cause the player harm rather than good. I would also add a title screen or an extra level."},
            { "type": "text", "header": "What other work does this make you want to do?", "data": "I want to try designing a 2D platformer that requires skill and practice to complete. This gameplay loop would reward the player's time spent playing."},
            { "type": "text", "header": "Other thoughts about this piece:", "data": "I really like how this game came out; the team went above and beyond in design for a lower division class."}
        ]
    },

    {
        "timeline": "2022 Spring",
        "image": "/projects/images/ship-2-c.png",
        "gif": "/projects/gifs/ship-showcase.gif",
        "title": "Abandoned Ship",
        "description": "Horror Link-based Game",
        "technology": "Twine",
        "published": "Github Pages",
        "playLink": "https://meyerphil.github.io/abandon-ship/",
        "work": [
            "Dreadful Concept Design and Writing",
            "Condition-based Scripting and Endings",
            "3-Digit Code Input for Locked Door"
        ],
        "more_info": [
            { "type": "text", "header": "What part did you do?", "data": "I did the writing, scripting, and design. I didn’t create the images, they were found on the internet."},
            { "type": "text", "header": "What skills does it demonstrate?", "data": "Concept Design, Scripting, Programming, Writing. It shows that I can create a concept from a simple narrative prompt into a playable text adventure. That I can implement something like inputting a correct code to unlock an area or a bunch of conditional-based text. I can also create imagery and a sense of dread or fear in writing."},
            { "type": "text", "header": "What would you do differently if you started this over?", "data": "I would try to create more flow within the game. Maybe have a map made, if that is possible in Twine, so the player doesn’t get lost. Also try to have original artwork or images, adding audio too."},
            { "type": "text", "header": "What other work does this make you want to do?", "data": "This made me want to explore development of creepy experiences in games, working in a horror-genre if you will."},
            { "type": "text", "header": "Other thoughts about this piece:", "data": "Looking back I am impressed with its simplicity but also its fun. I think using a link-based game engine is much different compared to a very universal game engine like Unity or Unreal."}
        ]
    },

    {
        "timeline": "2022 Fall",
        "image": "/projects/images/asg5-screengrab.png",
        "gif": "/projects/gifs/asg5-showcase.gif",
        "title": "The Foggy Statue",
        "description": "Demo",
        "technology": "WebGL/Three.JS",
        "work": [
            "Created Scene and Environment",
            "Imported Custom 3D Models",
            "Added Shadows to Objects",
            "Added Fog and Orthographic Camera",
            "Moving Ocean Texture and Skybox Stars"
        ]
    },

    {
        "timeline": "2022 Fall",
        "image": "/projects/images/asg4-screengrab.png",
        "gif": "/projects/gifs/asg4-showcase.gif",
        "title": "Lighting the Room",
        "description": "Demo",
        "technology": "WebGL/GLSL",
        "work": [
            "Created Environment and 'Phong' Lighting",
            "Spotlight to Focus Light in a Direction",
            "Lighting Works with Monkey Model"
        ]
    },

    {
        "timeline": "2022 Fall",
        "image": "/projects/images/asg3-screengrab.png",
        "gif": "/projects/gifs/asg3-showcase.gif",
        "title": "BuildBreak World",
        "description": "Demo",
        "technology": "WebGL/GLSL",
        "work": [
            "First-Person Movement",
            "Camera Rotation with Mouse Drag",
            "Able to Build/Break Blocks",
            "Collision Detection",
            "Multiple Textures and UV coords",
            "Monkey Model and Animation"
        ]
    },

    {
        "timeline": "2023 Spring",
        "image": "/projects/images/sushi.png",
        "gif": "/projects/gifs/sushi-game.gif",
        "title": "Star Surf Sushi",
        "description": "Mobile Friendly Sushi Tycoon",
        "technology": "Phaser",
        "published": "Github Pages",
        "playLink": "https://meyerphil.github.io/Sushi-game/main.html",
        "work": [
            "Implemented Sushi Recipes, Customers",
            "Added Progression of Supply, Cash, Stats",
            "End of Day Results and Fish Supply Shop",
            "Integrated Art Assets to create Dynamic UI",
            "JSON-driven Tutorial with Video Example",
            "Used Browser Cookie to save music setting"
        ],
        "more_info": [
            { "type": "video", "header": "Star Surf Sushi", "src": "https://www.youtube.com/embed/ljOBJqWgxPo", "title": "Star Surf Sushi | gameplayExample"},
            { "type": "text", "header": "My Role", "data": "In a team of three, my role in 'Star Surf Sushi' was Testing Lead. <br><br>After a small prototype was created by my teammate, I took over the project and implemented most of the features. I was responsible for combining all of our prototypes. I also integrated the art assets."},
            { "type": "image", "path": "/projects/images/pages/star-surf-sushi/game-init.png", "subtitle" : "Initial Prototype I Took Over"},
            { "type": "text", "header": "My Work", "data": "I implemented the Sushi Recipes, allowing for customers to order a variety of menu items and for players to create different combinations of ingredients. I added day-to-day progression, such as ingredient supply and total cash amount. <br><br>There are also statistics(correct/incorrect/timeout orders) presented to the player, emphasizing the importance of being fast and attentive when running the sushi shop."},
            { "type": "image", "path": "/projects/images/pages/star-surf-sushi/game-final.png", "subtitle" : "My Final Kitchen Iteration"},
            { "type": "text", "header": "My Ideas", "data": "I decided to also add some of my own ideas, such as making the current dish draggable to the customer or draggable to a newly added trash can. <br><br> Why did I add a trash can? I was thinking if we have a basic rating system, your rating/score goes down if you give the wrong order. It would incentivize you to catch your mistakes before serving the food and to throw away the wrong dish in the trash(at the cost of wasting resources of course). <br><br> Another idea of mine was an in-game tutorial. Since the player is running a sushi shop on a planet that doesn’t speak English, figuring out how to play won’t come naturally. As a result, I added a text tutorial(driven by a JSON file) for contextualization and instructions. If that isn’t enough, I also added a video of example gameplay."},
            { "type": "image", "path": "/projects/images/pages/star-surf-sushi/tutorial-final.png", "subtitle" : "First Page of Tutorial"},
            { "type": "image", "path": "/projects/images/pages/star-surf-sushi/shop-init.png", "subtitle" : "Initial End Of Day Screen"},
            { "type": "text", "header": "End Of Day", "data": "I created the End of Day Result screen, showing the current stock and money earned. This screen allows players to order ingredients(if sufficient funds are available) to stock up for the next day. <br><br> The player can either start the next day or quit to the main menu, where they can click ‘continue’ to resume their sushi career. <br><br> Using custom art assets(.png’s) representing each numerical(0-9) digit, I scripted a functional numerical system/font that can be seen below:"},
            { "type": "image", "path": "/projects/images/pages/star-surf-sushi/shop-final.png", "subtitle" : "Final End Of Day Screen"},
            { "type": "text", "header": "The Small Things", "data": "I also ensured the Browser Cookie to save the music setting(muted/unmuted) worked. So if one were to come back to play the game at a later date, their sound setting would be saved(may extend this to shop progression too). <br><br> I added some procedurally generated sounds to satisfy one of the assignment requirements."},
            { "type": "image", "path": "/projects/images/pages/star-surf-sushi/settings-final.png", "subtitle" : "Settings Page"}
        ]
    },

    {
        "timeline": "2023 Spring",
        "image": "/projects/images/last-extract-1.png",
        "gif": "/projects/gifs/purple-game.gif",
        "title": "The Last Extraction",
        "description": "Dual Narrative",
        "technology": "Phaser",
        "published": "Itch.io",
        "playLink": "https://philm3r.itch.io/the-last-extraction",
        "work": [
            "UI Implementation and Dialog 'typing' effect",
            "Split-Screen Player Controllers and Actions",
            "Dual Scene Loading System",
            "Anything else tech. related",
            "Published to Itch.io"
        ],
         "more_info": [
            { "type": "video", "header": "The Last Extraction", "src": "https://www.youtube.com/embed/JLfOdZK2om8", "title": "The Last Extraction | Gameplay Demo"},
            { "type": "text", "header": "My Role", "data": "In a team of 4, I was the programmer. I would take feedback from my team and conduct debugging.<br><br>Our team chose “Uncanny Mutation” as our theme.<br><br>There are radioactive rocks that glow purple. An aboveground community harvests these rocks,  however they undergo strong effects of the radiation. As a result, the people and the plants can be seen with mutations.<br><br>An underground community uses these rocks for a variety of needs, however they chose to stay ignorant of the harmful effects.<br><br>We wanted a dual narrative approach to address this theme, what better way to do it than with a split screen setup that shows two different sides of the world."},
            { "type": "text", "header": "From Idea to Reality", "data": "The idea of splitscreen was loosely thrown around, we had no idea if it was even possible or feasible to implement. As the programmer, I took it upon myself to bring that idea to life. <br><br> I decided to use Phaser, a browser-based JS game engine. We were supposed to learn it in the co-enrolled class, however I wanted to teach myself the game engine weeks early, giving myself an edge in learning.<br><br>I remember presenting The Last Extraction to the class. I heard awes of wonder as they watched two players play through the game at the same time. <br><br> At this point, every student has learned Phaser in our other class, so they had a general idea of the limitations of the game engine. <br><br> A student asked me a question, “How difficult was it to get splitscreen to work?” <br><br> I remember laughing and looking at the ground. <br><br> I told him, “Way too hard.” <br><br> The professor nodded and everyone understood the achievement of my work. Our team felt that much sweeter and satisfied with our final project."},
            { "type": "image", "path": "/projects/images/pages/last-extraction/initial-test.png", "subtitle" : "First Splitscreen Prototype (WASD, Arrows for Controls)"},
            { "type": "text", "header": "Split-Screen and Two Characters", "data": "Through many trials and errors that required multiple all-nighters and headaches, the game was complete.<br><br>I started with a basic prototype. I had two goals:<br><br> - Create two characters that can be independently controlled by two players.<br><br> - To see if I could create two separate cameras that could follow each character. I ensured each camera only occupied half of the screen."},
            { "type": "image", "path": "/projects/images/pages/last-extraction/t-meet.png", "subtitle" : "They Meet for the First Time - photo credit: Tau"},
            { "type": "text", "header": "They Finally Meet", "data": "The second iteration meant creating separate scenes for each character. <br><br> I had two exclusive scenes, and a third scene where they could meet at the same time. This meant one player had to initialize the shared scene(if it wasn’t loaded yet), then the next player would load into the shared scene instance.<br><br>This required a lot of scripting for things like cameras and characters to initialize and load just right."},

            { "type": "section", "title": "Integrating Art and Design", "subtitle": "Being The Only Programmer"},

            { "type": "text", "header": "Walking", "data": "I had to also implement the walking animation sprite sheets into each character controller. This took some back-and-forth communication with one of the artists to ensure the assets were formatted correctly.<br><br>I also gave different movement speed among players, further reflecting their differences.<br><br> This later became a notable feature, as we have received positive feedback from a friend who played our game."},
            { "type": "projectbox",
            "header": "The Last Extraction", 
            "src": "https://www.youtube.com/embed/DLiuR3FZWYc", 
            "title": "The Last Extraction | init walking anims novice",
            "description": "Novice Character Walking Animations",
            "work": [
                "Used Artist-supplied Sprite Sheet",
                "Initial Test of Novice's Walking Anim.",
                "Updated 2D Controller to trigger Anim."
            ]
            },
            { "type": "projectbox",
            "header": "The Last Extraction", 
            "src": "https://www.youtube.com/embed/5YCPul0R-B4", 
            "title": "The Last Extraction | walking anims vet",
            "description": "Veteran Character Walking Animations",
            "work": [
                "Used Artist-supplied Sprite Sheet",
                "Initial Test of Veteran's Walking Anim.",
                "Updated 2D Controller to trigger Anim."
            ]
            },

            { "type": "section", "title": "", "subtitle": "Dual Dialog"},
            { "type": "text", "header": "Dialog Development", "data": "The next step was adding NPCs and dialog. <br><br> I asked my team if the dialog is different towards each player? I also asked them if the dialog stops when the player walks away or the dialog stays for a few seconds(not good for slow readers/accessibility)?<br><br>As a result, I added dual dialog boxes and dialog conversations catered specifically to each player. For accessibility reasons, I have decided that a player’s conversation would start, progress, and end using the interaction key."},
            { "type": "projectbox",
            "header": "The Last Extraction", 
            "src": "https://www.youtube.com/embed/4GeLxdYFl5M", 
            "title": "The Last Extraction | novice dialog test",
            "description": "Novice's Dialog Test",
            "work": [
                "Used Artist-supplied Sprites/Tiles",
                "Added Dialog Box",
                "Added Portraits of Current Speaker",
                "Dialog Sourced From File",
                "Created Dialog 'Typing' Effect",
                "Dialog Ability Completed for Novice Character"
            ]
            },
            { "type": "projectbox",
            "header": "The Last Extraction", 
            "src": "https://www.youtube.com/embed/S2_BhmbnVjA", 
            "title": "The Last Extraction | what hapomn",
            "description": "Veteran's Initial Dialog Test",
            "work": [
                "Font Updated",
                "Used Artist-supplied Sprites/Tiles",
                "Added Dialog Ability for Veteran Character"
            ]
            },
            { "type": "projectbox",
            "header": "The Last Extraction", 
            "src": "https://www.youtube.com/embed/4Y6q_LpTEEs", 
            "title": "The Last Extraction | dual dialog",
            "description": "Dual Dialog Demonstration",
            "work": [
                "Both Players can Initiate Dialog",
                "One Player to Speak to NPC at a Time",
                "Fullscreen Option(Full HD) Added"
            ]
            },
            { "type": "section", "title": "", "subtitle": "Buildings and Objects"},

            { "type": "image", "path": "/projects/images/pages/last-extraction/p-buildings.png", "subtitle" : "Initial Buildings Test"},
            { "type": "text", "header": "Building Problems", "data": "Players could walk through buildings and objects, so I had to add hitboxes to them.<br><br> I devised a script that stops player movement upon collision with objects. I also had to determine whether the player sprite would overlap or underlap an object based on the collision position. <br><br>This took a lot of fine-tuning, it isn't perfect but it gets the job done."},
            { "type": "image", "path": "/projects/images/pages/last-extraction/p-tiles.png", "subtitle" : "How the World is Built(100px by 100px tiles)"},

            { "type": "projectbox",
            "header": "The Last Extraction", 
            "src": "https://www.youtube.com/embed/U1I7Q4FlgqQ", 
            "title": "The Last Extraction | novice room",
            "description": "Novice's Room Progress",
            "work": [
                "Used Artist-supplied Sprites/Tiles",
                "Created the Starting Room Area for Novice"
            ]
            },
            { "type": "image", "path": "/projects/images/pages/last-extraction/city-no-road.png", "subtitle" : "First Iteration of City(No road tiles)"},
            { "type": "projectbox",
            "header": "The Last Extraction", 
            "src": "https://www.youtube.com/embed/WHLlR-vXtv8", 
            "title": "The Last Extraction | city with roads",
            "description": "Novice's City Progress",
            "work": [
                "Used Artist-supplied Sprites/Tiles",
                "Created the City Area for Novice"
            ]
            },
            { "type": "projectbox",
            "header": "The Last Extraction", 
            "src": "https://www.youtube.com/embed/rXh_XwNYsy8", 
            "title": "The Last Extraction | vet mine progress",
            "description": "Veteran's Mine Progress",
            "work": [
                "Used Artist-supplied Sprites/Tiles",
                "Created the Starting Mine Area for Veteran"
            ]
            },

            { "type": "section", "title": "", "subtitle": "Final Touches"},
            { "type": "text", "header": "Debugging through Teamwork", "data": "The next iteration was more fine tuning and debugging after some playtests. <br><br> Here are some final moments driven by teamwork:"},
            { "type": "text", "header": "A Big Bug in the Mines", "data": "A significant bug was found, where a player could not enter the mines unless the other player also entered with them.<br><br>I determined that players could enter areas, but the issue was reloading a scene that a player has exited. I had to update my scene script to unload players and cameras.<br><br>This required an overhaul of how shared scenes are built. I not only scripted a more robust initialization/continuation process, but a new deinitialization process."},
            { "type": "text", "header": "Other Issues Found By Team", "data": "Players weren’t sent to the right spot when entering a new scene. I decided to keep track of their previous scene location and have them positioned in the new scene from where they left(next to the previous scene entrance).<br><br>Issues also occurred in the desert region between the city and town.<br><br>The novice couldn’t go back to their house and there was a random square in the desert that broke the game if either player interacted with it.<br><br>I fixed both doors and desert interactables rather quickly."},
            { "type": "text", "header": "Visual Trouble", "data": "One visual error was the fullscreen button I added. For two of my teammates, scaling was all off and dialog boxes were cut off. The game also didn’t revert back from fullscreen properly.<br><br>I could not solve this bug, however I do believe it is due to browser scaling, as zooming out on the page is a potential solution. I could probably adapt a script for resolution (1920x1080 seems to only work)."},
            { "type": "text", "header": "The Ending(s)", "data": "Finishing up, I asked my team if the game were to end at the same time or separately(end when going back home)? We felt that seperate would make more sense.<br><br>In my final iteration I added independent endings, for each player to end their side of the story at their own pace."}
         ]
    },
    
    {
        "timeline": "2023 Spring",
        "image": "/projects/images/wackypin.png",
        "gif": "/projects/gifs/wacky-showcase.gif",
        "title": "Wacky Pins",
        "description": "Bowling/Mini-Golf Fusion",
        "technology": "Phaser",
        "published": "Github Pages",
        "playLink": "https://meyerphil.github.io/CMPM120-D3/",
        "work": [
            "Physics-Based Level Design",
            "Ball-Launching Mechanic using Math Formulas",
            "Pin Position Check and Formation Function"
        ]
    },

    {
        "timeline": "2023 Spring",
        "image": "/projects/images/house-2.png",
        "gif": "/projects/gifs/house-showcase.gif",
        "title": "Escape the House",
        "description": "Horror Adventure Game",
        "technology": "Phaser",
        "published": "Github Pages",
        "playLink": "https://meyerphil.github.io/CMPM120Adventure/",
        "work": [
            "Dreadful Concept Design and Writing",
            "Condition-based Scripting and Endings",
            "3-Digit Code Input for Locked Door",
            "Utilized and Upgraded Adventure Engine"
        ]
    },

    {
        "timeline": "2023 Spring",
        "image": "/projects/images/color-2.png",
        "gif": "/projects/gifs/color-showcase.gif",
        "title": "Color Inside",
        "description": "2D Reverie Platformer",
        "technology": "Phaser",
        "published": "Github Pages",
        "playLink": "https://meyerphil.github.io/ColorInsideGame/",
        "work": [
            "Programming and Implementation",
            "2D Controller and Geometric Shooting",
            "Randomized Level Mechanics",
            "Sprite Art made with MS Paint",
            "Self-taught Phaser Engine"
        ]
    }

]